app/controllers/proposals_controller.rb

SELECT "proposals".* FROM "proposals"
---
def index

    @proposals = Proposal.all

INSERT INTO "proposals" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-04 16:50:51.766096"], ["title", "Pin number 4 - User 1"], ["updated_at", "2014-11-04 16:50:51.766096"], ["user_id", 1]]
---
  def create
    @proposal = current_user.proposals.build(proposal_params)
    @proposal.save

UPDATE "proposals" SET "document_file_name" = ?, "document_updated_at" = ?, "updated_at" = ? WHERE "proposals"."id" = 14  [["document_file_name", "TECMrequirements_fall_2014.pdf"], ["document_updated_at", "2014-11-05 00:44:39.751908"], ["updated_at", "2014-11-05 00:44:39.774564"]]
---
  def update
   @proposal.update(proposal_params)

DELETE FROM "proposals" WHERE "proposals"."id" = ?  [["id", 3]]
---
  def destroy
    @proposal.destroy